<script setup lang="ts">

</script>

<template>
  <div class="container">
    <h2>奶果开发创造者方向</h2>
    <h3>计算机科学方向</h3>
    <p>奶果作为以Bot为起点的服务，其主要的技术开发方向便是计算机科学方向，由于第三方SDK已经被QQ围堵严重，故而办理企业执照使用QQ官方SDK开发机器人。</p>
    <p>奶果作为公益无偿项目，目前的开发要点为机器人、网页、数据结构处理，后台管理系统的开发。次要点为群内文字图片小游戏，网页轻量小游戏的开发。</p>
    <p>应用到的技术是语言方面的C++、Java、Python、JavaScript、Html、Sass；其技术框架目前已用SpringBoot、Django、NonebotV2、Vue3及其工具技术。永久层采用Redis、MySQL数据管理技术。</p>
    <h3>美术美工设计方向</h3>
    <p>目前奶果并没有自己的二次元形象，美术美工设计方向无法推进。</p>
    <h2>成为奶果开发创作者可以做什么</h2>
    <p>理论上可以做一切非盈利的事情，但这里可以为大家稍稍举例：</p>
    <ul>
      <li>奶果机器人各种插件开发（比如生活服务类、查询类、游戏查询类、文字图片群聊轻游戏类、群娱乐类等）</li>
      <li>奶果网站开发（比如页面设计开发、页面功能开发、页面轻游戏开发等）</li>
      <li>奶果数据开发：调试数据结构算法，高效管理用户档案信息，调试后端复杂度与数据永久层的兼容</li>
      <li>进入奶果开发创作者认证后，志愿者每次要开发什么，需要在群内交流，以免开发后超级管理不知道而强制回滚版本，理论上志愿者只需要汇报一下要做什么即可，只要合法合规就不受限制。</li>
      <li>志愿者申请新Bot或者申请开发小程序小游戏App时，需遵守契约中的规定，详细写好文件向哈尔滨喵羽网络科技有限公司提起独立开发申请，并耐心等待公司回信与纸质合同。</li>
    </ul>
    <h2>奶果开发与创造的价值</h2>
    <p>奶果作为公益开源服务，同理也需要招纳志愿开发创作者，由于QQ机器人与其它开发的需求上需要企业营业执照，而多数个人开发者没有精力和资金也没必要注册企业营业执照，喵羽网络科技的奶果可以成为各位开发创作者的摇篮，成为上线运行的第一个锻炼。</p>
    <p>开发创作者为奶果志愿的劳动成果，应归奶果的上属公司哈尔滨喵羽网络科技有限公司所有，而这并不意味着奶果要吞并志愿者们的劳动成果，每一个被采纳的劳动成果，都会有公章文件为志愿者证明其开发与创作能力，其软件与知识著作第一作者归志愿者所有，在奶果所涵盖的范围内将永久公示为奶果做出贡献的志愿者们，喵羽网络科技与其他方签署商业合作时会优先从奶果开发创作者名单中择选人员参加商业项目并分红分成。</p>
    <p>奶果原始开发者（夜战笨蛋Yasenbaka）希望能通过这样的项目，结识在计算机科学与平面设计上相关的朋友，互帮互助、共同成长。</p>
  </div>
</template>

<style scoped lang="sass">

</style>